app/controllers/districts_controller.rb

  def edit
    @district = District.find(params[:id])
---
SELECT * FROM `districts` WHERE (`districts`.`id` = 27)

  def update
    @district = District.find(params[:id])

    respond_to do |format|
      if @district.update_attributes(params[:district])
---
SELECT * FROM `districts` WHERE (`districts`.`id` = 27)
UPDATE `districts` SET `phone` = '732-818-0461', `director` = 'Pamela Heglund', `mobile_phone` = '732-244-5463', `email` = 'SchPgh@aol.com' WHERE `id` = 27

  def destroy
    @district = District.find(params[:id])
    @district.destroy
---
SELECT * FROM `districts` WHERE (`districts`.`id` = 53)
DELETE FROM `districts` WHERE `id` = 53