app/controllers/equipment_registrations_controller.rb

SELECT * FROM `pages` WHERE (`pages`.`label` = 'Equipment Registration Text') LIMIT 1
---
  def new
    @equipment_registration = EquipmentRegistration.new
    @equipment_registration.user = current_user
    @districts = District.find(:all, :order => "name")

    # find our equipment page
    @page = Page.find_by_label('Equipment Registration Text')