app/controllers/equipment_controller.rb

SELECT * FROM `equipment_registrations` WHERE (`equipment_registrations`.`id` = 154)
SELECT * FROM `equipment`
SELECT * FROM `rooms` WHERE (`rooms`.`id` = 60)
---
  def index
    @equipment = Equipment.find(:all, :joins => [:equipment_registration], :conditions => "equipment_registrations.event_id = #{Event.active_event.id}")
    @rooms = Room.all(:order => 'name asc', :conditions => "event_id = #{Event.active_event.id}")