app/controllers/evaluations_controller.rb

SELECT * FROM `evaluations` WHERE (`evaluations`.`key` = '1260dd368374186f599145105e233fcb') LIMIT 1
---
  def show_from_key
    @evaluation = Evaluation.find_by_key(params[:key])

SELECT * FROM `evaluations` WHERE (`evaluations`.`id` = 1)
UPDATE `evaluations` SET `ruling` = '5 - Exceeds expectations', `knowledge_material_explanation` = 'abcd', `rapport_quizzers` = '5 - Exceeds expectations', `district_id` = 62, `knowledge_material` = '5 - Exceeds expectations', `ruling_explanation` = 'abcd', `reading` = '5 - Exceeds expectations', `rapport_coaches` = '5 - Exceeds expectations', `reading_explanation` = 'abcd', `where_observed` = 'national, regional, district events', `position` = 'District Director', `knowledge_ruling_explanation` = 'abcd', `knowledge_ruling` = '5 - Exceeds expectations', `level` = '2011 - NYC - Louisville', `best_suited` = 'QM', `rapport_quizzers_explanation` = 'abcd', `rapport_coaches_explanation` = 'abcd', `updated_at` = '2012-02-09 02:35:36', `name` = 'Todd Olson' WHERE `id` = 2
---
  def update
    @evaluation = Evaluation.find(params[:id])

    record_not_found and return if @evaluation.key != params[:evaluation][:key]

    respond_to do |format|
      if @evaluation.update_attributes(params[:evaluation])