app/controllers/housing_rooms_controller.rb

SELECT * FROM `buildings` ORDER BY name
---
  def index
    # if we aren't an admin or housing admin we shouldn't be here
    record_not_found and return if !admin? and !housing_admin?

    @housing_rooms = HousingRoom.ordered_by_building_and_room