app/controllers/officials_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    if params[:user_id]
      @officials = Official.find(:all, :conditions => "user_id = #{params[:user_id]}", :order => "first_name asc")
      @user = User.find(params[:user_id])

SELECT * FROM `pages` WHERE (`pages`.`label` = 'Register Officials Text') LIMIT 1
---
  def new
    @official = Official.new
    @official.user = current_user
    @districts = District.find(:all, :order => "name")

    # find the text for the officials registration page
    @page = Page.find_by_label('Register Officials Text')

INSERT INTO `officials` (`roles`, `updated_at`, `creator_id`, `district_id`, `phone`, `user_id`, `first_name`, `last_name`, `email`, `created_at`) VALUES('--- \n- Quizmaster\n- Content Judge\n', '2012-02-03 21:31:25', 1, 4, '312-375-8674', 1, 'Jeremy', 'Driscoll', 'jdriscoll@realnets.com', '2012-02-03 21:31:25')
---
  def create
    @official = Official.new(params[:official])
    if (params[:official][:user_id].nil?)
      @user = @official.user = current_user
    else
      @user = @official.user
    end
    @official.creator = current_user

    respond_to do |format|
      if @official.save

SELECT * FROM `evaluations` WHERE (official_id = 1 and sent_to_email = 'CCDQUIZ@yahoo.com') LIMIT 1
INSERT INTO `evaluations` (`name`, `best_suited`, `sent_to_name`, `reading`, `ruling_explanation`, `knowledge_material`, `updated_at`, `sent_to_email`, `level`, `where_observed`, `knowledge_ruling`, `rapport_coaches`, `district_id`, `rapport_coaches_explanation`, `reading_explanation`, `knowledge_material_explanation`, `rapport_quizzers_explanation`, `complete`, `ruling`, `official_id`, `rapport_quizzers`, `key`, `knowledge_ruling_explanation`, `position`, `created_at`) VALUES(NULL, NULL, 'Scott & Sara Christensen', NULL, NULL, NULL, '2012-02-03 21:56:49', 'CCDQUIZ@yahoo.com', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 2, NULL, '1260dd368374186f599145105e233fcb', NULL, NULL, '2012-02-03 21:56:49')
---
  def send_evaluation
    # check and make sure this evaluation hasn't already been sent
    return if Evaluation.find(:first, :conditions => "official_id = #{params[:id]} and sent_to_email = '#{params[:sent_to_email]}'")

    # create a new evaluation
    @evaluation = Evaluation.new
    @evaluation.sent_to_name = params[:sent_to_name]
    @evaluation.sent_to_email = params[:sent_to_email]
    @evaluation.official_id = params[:id]
    @evaluation.save