app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT * FROM `pages` ORDER BY label asc

  def home
    @page = Page.find_by_label('Home')
---
SELECT * FROM `pages` WHERE (`pages`.`label` = 'Home') LIMIT 1