app/controllers/participant_registrations_controller.rb

  def index
    if params[:user_id]
      @user = User.find(params[:user_id])
    else
      # if we aren't an admin we shouldn't be here
      record_not_found and return if !admin?

      @selected_event = params[:event_id] ? params[:event_id] : Event.active_event.id
      @events = Event.get_events
      #@participant_registrations = ParticipantRegistration.find(:all, :conditions => "event_id = #{@selected_event}", :order => "first_name asc, last_name asc")
      @participant_registrations = ParticipantRegistration.by_event(Event.active_event.id).ordered_by_last_name
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
SELECT * FROM `participant_registrations`

  def edit
    @participant_registration = ParticipantRegistration.find(params[:id])
    if params[:user_id]
      @user = User.find(params[:user_id])
      # if the users don't match we shouldn't be here
      record_not_found and return if @user != current_user and !admin?
    else
      # if we aren't an admin we shouldn't be here
      record_not_found and return if !admin?
    end

    # define shared users (if any)
    @shared_users = @participant_registration.shared_users

    registerable_items = RegisterableItem.all
    registerable_items.each do |registerable_item|
      registration_item = RegistrationItem.find(:first, :conditions => "participant_registration_id = #{@participant_registration.id.to_s} and registerable_item_id = #{registerable_item.id.to_s}")
---
SELECT * FROM `participant_registrations` WHERE (`participant_registrations`.`id` = 2)
SELECT * FROM `users` WHERE (`users`.`id` = 6) LIMIT 1
SELECT * FROM `registerable_items`
SELECT * FROM `registration_items` WHERE (participant_registration_id = 2 and registerable_item_id = 1) LIMIT 1

    get_schools

    # find page for participant registrations text
    @page = Page.find_by_label('Register Participant Text')
---
SELECT * FROM `pages` WHERE (`pages`.`label` = 'Register Participant Text') LIMIT 1