app/controllers/passwords_controller.rb

  def create
    @password = Password.new(params[:password])
    @password.user = User.find_by_email(@password.email)

    if @password.save
---
SELECT * FROM `users` WHERE (`users`.`email` = 'jdriscoll@realnets.com') LIMIT 1
INSERT INTO `passwords` (`expiration_date`, `updated_at`, `reset_code`, `user_id`, `created_at`) VALUES('2012-02-19 04:09:56', '2012-02-05 04:09:56', '4c7cf2b5a3f745cc81ec7e29d77e37aca5f975bb', 1, '2012-02-05 04:09:56')

  def reset
    begin
      @user = Password.find(:first, :conditions => ['reset_code = ? and expiration_date > ?', params[:reset_code], Time.now]).user
---
SELECT * FROM `passwords` WHERE (reset_code = '4c7cf2b5a3f745cc81ec7e29d77e37aca5f975bb' and expiration_date > '2012-02-04 22:10:12') LIMIT 1
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def update_after_forgetting
    @user = Password.find_by_reset_code(params[:reset_code]).user

    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]

    error = false
    error = true if @user.password != @user.password_confirmation
    error = true if @user.password.blank?

    if !error
      @user.save false
---
SELECT * FROM `passwords` WHERE (`passwords`.`reset_code` = '4c7cf2b5a3f745cc81ec7e29d77e37aca5f975bb') LIMIT 1
UPDATE `users` SET `crypted_password` = '8205ea5a6b5e7839f3057c6f416c72f6ef32d15f', `updated_at` = '2012-02-05 04:40:24' WHERE `id` = 1