app/controllers/regions_controller.rb

  def edit
    @region = Region.find(params[:id])
---
SELECT * FROM `regions` WHERE (`regions`.`id` = 10)

  def update
    @region = Region.find(params[:id])

    respond_to do |format|
      if @region.update_attributes(params[:region])
---
SELECT * FROM `regions` WHERE (`regions`.`id` = 10)
UPDATE `regions` SET `name` = 'MesoAmerica' WHERE `id` = 10