app/controllers/stats_controller.rb

  def index
    # for teams
    @teams = Array.new
    teams = QuizTeam.find(:all, :conditions => "quiz_division_id = '1'", :order => "rank asc", :limit => 5)
---
SELECT * FROM `quiz_teams` WHERE (quiz_division_id = '4' and pool = 'A') ORDER BY manual_rank asc LIMIT 5