app/controllers/team_registrations_controller.rb

  def index
    if params[:user_id]
      @team_registrations = TeamRegistration.find(:all, :conditions => "user_id = #{params[:user_id]} and event_id = #{Event.active_event.id}")
      @user = User.find(params[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1

  def show
    @team_registration = TeamRegistration.find(params[:id])
---
SELECT * FROM `team_registrations` WHERE (`team_registrations`.`id` = 6)

  def new
    # if registration is closed and we don't have a code we redirect
    if !Event.active_event.enable_team_registration? and params[:code] != Event.active_event.team_code
      respond_to do |format|
        format.html { redirect_to(root_url) }
      end
      return
    end

    @team_registration = TeamRegistration.new
    @districts = District.find(:all, :order => "name")
    @active_event = Event.active_event.id
    @divisions = Division.find(:all, :conditions => "event_id = #{@active_event}" )
    if (admin?)
      @coaches = ParticipantRegistration.find(:all, :conditions => "(registration_type = 'coach' OR planning_on_coaching = 1) and event_id = #{@active_event}", :order => "first_name asc, last_name asc")
    else
      @coaches = ParticipantRegistration.find(:all, :joins => "inner join districts on participant_registrations.district_id = districts.id inner join regions on districts.region_id = regions.id", :conditions => "(registration_type = 'coach' OR planning_on_coaching = 1) and region_id = #{current_user.district.region.id} and event_id = #{@active_event}")
    end

    # find our first page (which should be the new team registration text)
    @page = Page.find_by_label('Register Teams Text')
---
SELECT * FROM `regions` WHERE (`regions`.`id` = 11)
SELECT * FROM `pages` WHERE (`pages`.`label` = 'Register Teams Text') LIMIT 1

  def edit
    @team_registration = TeamRegistration.find(params[:id])
    if params[:user_id]
      @user = User.find(params[:user_id])
      # if the users don't match we shouldn't be here
      record_not_found and return if @user != current_user and !admin?
    else
      # if we aren't an admin we shouldn't be here
      record_not_found and return if !admin?
    end

    @districts = District.find(:all, :order => "name")
    @active_event = Event.active_event.id
    @divisions = Division.find(:all, :conditions => "event_id = #{@active_event}" )
    if (admin?)
      @coaches = ParticipantRegistration.find(:all, :conditions => "(registration_type = 'coach' OR registration_type = 'staff' OR planning_on_coaching = 1) and event_id = #{@active_event}", :order => "first_name asc, last_name asc")
    else
      @coaches = ParticipantRegistration.find(:all, :joins => "inner join districts on participant_registrations.district_id = districts.id inner join regions on districts.region_id = regions.id", :conditions => "(registration_type = 'coach' OR registration_type = 'staff' OR planning_on_coaching = 1) and region_id = #{current_user.district.region.id} and event_id = #{@active_event}")
---
SELECT * FROM `team_registrations` WHERE (`team_registrations`.`id` = 8)
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `districts` WHERE (`districts`.`id` = 4)
SELECT * FROM `divisions` WHERE (`divisions`.`id` = 5)
SELECT * FROM `regions` WHERE (`regions`.`id` = 2)