app/controllers/users_controller.rb

  def index
    # grab all users
    @users = User.search(params[:q], {:page => current_page})
---
SELECT * FROM `pages` ORDER BY label asc
SELECT * FROM `users` WHERE (first_name like '%Paul%' or last_name like '%Paul%' or email like '%Paul%') ORDER BY first_name asc LIMIT 0, 30
SELECT count(*) AS count_all FROM `users` WHERE (first_name like '%bker%' or last_name like '%bker%' or email like '%bker%')

  def edit
    if !params[:id].nil? and !admin?
      record_not_found
      return
    elsif !params[:id].nil? and admin?
      @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      format.html {
        if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `phone` = '312-375-8674', `communicate_by_email` = 1, `crypted_password` = '22bc3d7723eb7ebe74ae384fc795e1f8c3124f4c', `updated_at` = '2012-02-28 01:01:05' WHERE `id` = 1